package com.company;
import java.util.*;

/*
Створити структуру класів для реалізації додатку, схожого на наведений вище приклад, а саме:


До лакофарбового цеху фірми надходять вироби трьох типів для фарбування.
Перший тип – це вироби у формі кулі.
Другий тип – це тонкі листи. Площа поверхні цих виробів обчислюється на підставі відомих розмірів.
Третій тип – це деталі складної форми, площа поверхні яких визначена у документах на деталь.
Кожна з деталей має свій номер.


Окрім того фарбу продають, наливаючи у довільну тару.
Для операції продажу фіксують вид фарби, кількість, та ім’я покупця.
Фарби бувають різного кольору    і різної вартості.
Витрата фарби на фарбування обчислюється як добуток площі поверхні на норму витрати, яка залежіть від фарби.


Треба вести облік пофарбованих деталей та операцій продажу і обчислювати загальну вартість витраченої фарби.
*/
public class Main {
    public static void main(String[] args) {
        Virob virob = new Virob();
        Txt txt = new Txt();
        Farba farba = new Farba();
        Uchet uchet = new Uchet(0, "0", "0", "0",0);
        Scanner in = new Scanner(System.in);
        int choose = 0;

        System.out.print("\nЛакофарбовий цех фірми \"CastleDwania\"");
        do {
            choose = txt.menu();
            if(choose == 0)
                System.exit(0);
            else if (choose == 1)
                virob.virob_menu();
            else if (choose == 2)
                farba.farb_menu();
            else uchet.menu();
        }while(true);
    }
}
